app/views/detalles/edit.html.erb

<%= semantic_form_for [@detalle] do |fd| %>
  <%= fd.input :cuenta, :as => :select, :collection => Cuenta.all.map{|c| [c.nombre, c.id]} %>
---
SELECT "cuentas".* FROM "cuentas"

  <%= fd.input :haber %>
  <%= fd.input :centro_costo, :as => :select, :collection => CentroCosto.all.map{|c| [c.nombre, c.id]} %>
---
SELECT "centro_costos".* FROM "centro_costos"