app/views/detalles/new.html.erb

<%= semantic_form_for [@asiento, @detalle] do |fd| %>
  <%= fd.input :cuenta, :as => :select, :collection => Cuenta.all.map{|c| [c.nombre, c.id]} %>
---
SELECT "cuentas".* FROM "cuentas"