app/views/asientos/_form.html.erb

    <%= f.input :fecha , :as => :date %>
    <%= f.input :ejercicio, :as => :select, :collection => Ejercicio.all.map{|c| [c.descripcion, c.id]} %>
---
SELECT "ejercicios".* FROM "ejercicios"

        <td>
        <%= fd.input :cuenta, :label => false, :as => :select, :collection => Cuenta.all.map{|c| [c.nombre, c.id]} %>
---
SELECT "cuentas".* FROM "cuentas"

        <td>
<%= fd.input :centro_costo, :label => false, :as => :select, :collection => CentroCosto.all.map{|c| [c.nombre, c.id]} %>
---
SELECT "centro_costos".* FROM "centro_costos"