app/views/asientos/show.html.erb

SELECT "detalles".* FROM "detalles" WHERE ("detalles".asiento_id = 3)
---
  <tbody>
    <% @asiento.detalles.each do |fd| %>