app/controllers/asientos_controller.rb

  def index
    @asientos = Asiento.all
---
SELECT "asientos".* FROM "asientos"

  def show

    @asiento = Asiento.find(params[:id])
    # incluir en el modelo estos totales en forma automatica se acumulen
    @total_debe  = 0
    @total_haber = 0

    @asiento.detalles.each do |detalle|
---
SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 1) LIMIT 1
SELECT "detalles".* FROM "detalles" WHERE ("detalles".asiento_id = 3)

  def edit
    @asiento = Asiento.find(params[:id])
---
SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 1) LIMIT 1

  def create
    @asiento = Asiento.new(params[:asiento])

    respond_to do |format|
      if @asiento.save
---
INSERT INTO "asientos" ("descripcion", "fecha", "ejercicio_id", "created_at", "updated_at") VALUES ('apertura', '2011-01-01', NULL, '2011-01-12 18:46:59.287573', '2011-01-12 18:46:59.287573')

  def update
    @asiento = Asiento.find(params[:id])

    respond_to do |format|
      if @asiento.update_attributes(params[:asiento])
---
SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 3) LIMIT 1
UPDATE "asientos" SET "descripcion" = 'asiento 4 - modificado', "updated_at" = '2011-01-12 22:05:51.987580' WHERE ("asientos"."id" = 5)

  def imprimir
     require 'prawn'
     @asiento = Asiento.find(params[:id])
     @total_debe = 0
     @total_haber = 0

     Prawn::Document.generate('hello.pdf') do |pdf|
       pdf.text("   Asiento " + @asiento.descripcion.to_s + " del "+ @asiento.fecha.to_s)
       pdf.line_width = 2
       pdf.bounding_box [-2, 730], :width => 500, :height => 50 do
           pdf.stroke_bounds
       end

       @asiento.detalles.each do |detalle|
---
SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 2) LIMIT 1
SELECT "detalles".* FROM "detalles" WHERE ("detalles".asiento_id = 4)