app/controllers/centro_costos_controller.rb

SELECT "centro_costos".* FROM "centro_costos"
---
  def index
    @centro_costos = CentroCosto.all

SELECT "centro_costos".* FROM "centro_costos" WHERE ("centro_costos"."id" = 1) LIMIT 1
---
  def show
    @centro_costo = CentroCosto.find(params[:id])

INSERT INTO "centro_costos" ("nombre", "codigo", "created_at", "updated_at") VALUES ('ventas', '1', '2011-03-09 00:15:13.256867', '2011-03-09 00:15:13.256867')
---
  def create
    @centro_costo = CentroCosto.new(params[:centro_costo])

    respond_to do |format|
      if @centro_costo.save