app/controllers/cuentas_controller.rb

  def index
    @cuentas = Cuenta.all
---
SELECT "cuentas".* FROM "cuentas"

  def show
    @cuenta = Cuenta.find(params[:id])
---
SELECT "cuentas".* FROM "cuentas" WHERE ("cuentas"."id" = 1) LIMIT 1

  def edit
    @cuenta = Cuenta.find(params[:id])
---
SELECT "cuentas".* FROM "cuentas" WHERE ("cuentas"."id" = 1) LIMIT 1

  def create
    @cuenta = Cuenta.new(params[:cuenta])

    respond_to do |format|
      if @cuenta.save
---
INSERT INTO "cuentas" ("nombre", "codigo", "ajustada", "created_at", "updated_at") VALUES ('Efectivo', '1', 'f', '2011-01-12 17:51:34.205869', '2011-01-12 17:51:34.205869')

  def update
    @cuenta = Cuenta.find(params[:id])

    respond_to do |format|
      if @cuenta.update_attributes(params[:cuenta])
---
SELECT "cuentas".* FROM "cuentas" WHERE ("cuentas"."id" = 1) LIMIT 1
UPDATE "cuentas" SET "nombre" = 'Banco 2', "updated_at" = '2011-01-12 22:24:22.673545' WHERE ("cuentas"."id" = 3)