app/controllers/detalles_controller.rb

SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 5) LIMIT 1
---
   def new
      @detalle = Detalle.new
      @asiento = Asiento.find(params[:asiento_id])

SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 5) LIMIT 1
INSERT INTO "detalles" ("cuenta_id", "asiento_id", "descripcion", "debe", "haber", "created_at", "updated_at", "centro_costo_id") VALUES (2, 6, NULL, NULL, 10.0, '2011-03-09 15:49:10.873248', '2011-03-09 15:49:10.873248', NULL)
---
    def create
      @asiento = Asiento.find(params[:asiento_id])
      @detalle = @asiento.detalles.create(params[:detalle])

SELECT "detalles".* FROM "detalles" WHERE ("detalles"."id" = 3) LIMIT 1
SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 5) LIMIT 1
---
    def edit
      @detalle = Detalle.find(params[:id])
      @asiento = Asiento.find(@detalle.asiento_id)

SELECT "detalles".* FROM "detalles" WHERE ("detalles"."id" = 6) LIMIT 1
SELECT "asientos".* FROM "asientos" WHERE ("asientos"."id" = 5) LIMIT 1
DELETE FROM "detalles" WHERE ("detalles"."id" = 6)
---
    def destroy
      @detalle = Detalle.find(params[:id])
      @asiento = Asiento.find(@detalle.asiento_id)

      @detalle.destroy