app/controllers/ejercicios_controller.rb

  def index
    @ejercicios = Ejercicio.all
---
SELECT "ejercicios".* FROM "ejercicios"

  def show
    @ejercicio = Ejercicio.find(params[:id])
---
SELECT "ejercicios".* FROM "ejercicios" WHERE ("ejercicios"."id" = 1) LIMIT 1

  def create
    @ejercicio = Ejercicio.new(params[:ejercicio])

    respond_to do |format|
      if @ejercicio.save
---
INSERT INTO "ejercicios" ("descripcion", "inicio", "fin", "created_at", "updated_at") VALUES ('ej 2011', '2011-01-01', '2011-12-31', '2011-01-12 21:58:12.565683', '2011-01-12 21:58:12.565683')